v2206/atmospheric_Microclimate/00_test_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    /*0*/ xMin  -115; // L = 480
    /*1*/ xMax   365;
    /*2*/ yMin  -120; // L = 420
    /*3*/ yMax   300;
    /*4*/ zMin     0; // L = 150
    /*5*/ zMax   150;
    /*6*/ xCells  32;
    /*7*/ yCells  28;
    /*8*/ zCells  16;
}

convertToMeters 1;

vertices
(
    /*0*/ ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMin)
    /*1*/ ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMin)
    /*2*/ ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMin)
    /*3*/ ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMin)

    /*4*/ ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMax)
    /*5*/ ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMax)
    /*6*/ ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMax)
    /*7*/ ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $:backgroundMesh.xCells
        $:backgroundMesh.yCells
        $:backgroundMesh.zCells
    )
    simpleGrading 
    (
        // x-axis
        1
        // y-axis
        1
        // z-axis
        (
            (0.20 0.5 8)
            (0.80 0.5 1)
        )
    )
    // simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    west
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    east
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    
    north
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }  
    
    south
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }        

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
