v2206/atmospheric_Microclimate/00_test_case/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dimensions      [1 -1 -2 0 0 0 0]; // for compressible
dimensions      [0 2 -2 0 0 0 0];  // for incompressible

internalField   uniform 1e5; 

boundaryField
{
    west
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }
    east
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }
    top
    {
        type            fixedValue;
        value           uniform 101325;
    }
    ground
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 1e5; 
    }
    north
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }
    south
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }
    buildings
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }

    // west
    // {
    //     type            fixedFluxPressure;
    //     gradient        uniform 0; 
    //     value           uniform 1e5; 
    // }
    // east
    // {
    //     type            fixedFluxPressure;
    //     gradient        uniform 0; 
    //     value           uniform 1e5; 
    // }
    // top
    // {
    //     type            fixedValue;
    //     value           uniform 101325;
    // }
    // ground
    // {
    //     type            fixedFluxPressure;
    //     gradient        uniform 0;
    //     value           uniform 1e5; 
    // }
    // north
    // {
    //     type            fixedFluxPressure;
    //     gradient        uniform 0; 
    //     value           uniform 1e5; 
    // }
    // south
    // {
    //     type            fixedFluxPressure;
    //     gradient        uniform 0; 
    //     value           uniform 1e5; 
    // }
    // buildings
    // {
    //     type            fixedFluxPressure;
    //     gradient        uniform 0; 
    //     value           uniform 1e5; 
    // }
}


// ************************************************************************* //
