v2206/atmospheric_Microclimate/00_test_case/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// surfaces ("buildings_refined.stl");

// #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"

buildings_refined.stl { 
    extractionMethod            extractFromSurface;
    extractFromSurfaceCoeffs    { includedAngle 150; }

    subsetFeatures
    {
        nonManifoldEdges        no;
        openEdges               no;
    }
}



// ************************************************************************* //
