v2206/atmospheric_Microclimate/00_test_case/Allprepare
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
# ------------------------------------------------------------------------------

restore0Dir

# Mesh -------------------
runApplication blockMesh
runApplication surfaceFeatureExtract
runApplication decomposePar
runParallel snappyHexMesh -overwrite
runApplication reconstructParMesh -constant
# runApplication transformPoints -scale '(0.001 0.001 0.001)'
# runApplication setFields


# ----------------------------------------------------------------- end-of-file
